from ascii_magic import AsciiArt
import os
import shlex
text= "Мы, беларусы — мірныя людзі,\n" \
"Сэрцам адданыя роднай зямлі,\n" \
"Шчыра сябруем, сілы гартуем\n" \
"Мы ў працавітай, вольнай сям’і.\n" \
"Слаўся, зямлі нашай светлае імя,\n" \
"Слаўся, народаў братэрскі саюз!\n" \
"Наша любімая маці-Радзіма,\n" \
"Вечна жыві і квітней, Беларусь!\n" \
"Разам з братамі мужна вякамі\n" \
"Мы баранілі родны парог,\n" \
"У бітвах за волю, бітвах за долю\n" \
"Свой здабывалі сцяг перамог!\n" \
"Слаўся, зямлі нашай светлае імя,\n" \
"Слаўся, народаў братэрскі саюз!\n" \
"Наша любімая маці-Радзіма,\n" \
"Вечна жыві і квітней, Беларусь!\n" \
"Дружба народаў — сіла народаў —\n" \
"Наш запаветны, сонечны шлях.\n" \
"Горда ж узвіся ў ясныя высі,\n" \
"Сцяг пераможны — радасці сцяг!\n" \
"Слаўся, зямлі нашай светлае імя,\n" \
"Слаўся, народаў братэрскі саюз!\n" \
"Наша любімая маці-Радзіма,\n" \
"Вечна жыві і квітней, Беларусь!\n"
# print(text)
flag = AsciiArt.from_image("flag.jpg")
flag.to_terminal()
anthem = "anthem = "hymn.mp3""
os.system(f"mpg123 -q {shlex.quote(anthem)}")
